[Killed] ArrowFunction
src/App.tsx:590:18
 const HISTORY_DATE_FORMATTER = new Intl.DateTimeFormat(undefined, { dateStyle: 'medium', timeStyle: 'short' })
 
-  const select = (run: AnalysisHistoryItem) => onSelectRun(run)
+  const select = () => undefined
 }
killedBy: analysis history and quality KPI renders persisted KPI columns, opens a row, and deletes only after confirmation
statusReason: expected '#analyses' to be '#overview' // Object.is equality

[Timeout] ObjectLiteral
src/App.tsx:595:49
 }
 
-  const [sort, setSort] = useState<HotspotSort>({ column: 'hotspot_score', direction: 'desc' })
+  const [sort, setSort] = useState<HotspotSort>({})
   const [filters, setFilters] = useState<HotspotFilters>({ risks: [] })
   const [draftFilters, setDraftFilters] = useState<HotspotFilters>({ risks: [] })

[Survived] BooleanLiteral
src/App.tsx:598:60
   const [sort, setSort] = useState<HotspotSort>({ column: 'hotspot_score', direction: 'desc' })
   const [filters, setFilters] = useState<HotspotFilters>({ risks: [] })
   const [draftFilters, setDraftFilters] = useState<HotspotFilters>({ risks: [] })
-  const [filterDialogOpen, setFilterDialogOpen] = useState(false)
+  const [filterDialogOpen, setFilterDialogOpen] = useState(true)
   const [exportBusy, setExportBusy] = useState(false)
   const filteredHotspots = useMemo(() => filterHotspots(hotspots, filters), [filters, hotspots])

[Killed] BooleanLiteral
src/App.tsx:599:48
   const [filters, setFilters] = useState<HotspotFilters>({ risks: [] })
   const [draftFilters, setDraftFilters] = useState<HotspotFilters>({ risks: [] })
   const [filterDialogOpen, setFilterDialogOpen] = useState(false)
-  const [exportBusy, setExportBusy] = useState(false)
+  const [exportBusy, setExportBusy] = useState(true)
   const filteredHotspots = useMemo(() => filterHotspots(hotspots, filters), [filters, hotspots])
   const orderedHotspots = useMemo(() => sortHotspots(filteredHotspots, sort), [filteredHotspots, sort])
killedBy: completed analysis result loading filters, sorts, and exports hotspots using the visible rows
statusReason: Unable to find an accessible element with the role "button" and name "Export hotspots (.md)"

Here are the accessible roles:

  complementary:

  Name "":
  <aside

[Killed] ArrowFunction
src/App.tsx:600:36
   const [draftFilters, setDraftFilters] = useState<HotspotFilters>({ risks: [] })
   const [filterDialogOpen, setFilterDialogOpen] = useState(false)
   const [exportBusy, setExportBusy] = useState(false)
-  const filteredHotspots = useMemo(() => filterHotspots(hotspots, filters), [filters, hotspots])
+  const filteredHotspots = useMemo(() => undefined, [filters, hotspots])
   const orderedHotspots = useMemo(() => sortHotspots(filteredHotspots, sort), [filteredHotspots, sort])
   const toggleRisk = (risk: (typeof HOTSPOT_RISKS)[number]) => {
killedBy: completed analysis result loading keeps findings and hotspots after the polling status changes to completed
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ArrowFunction
src/App.tsx:601:35
   const [filterDialogOpen, setFilterDialogOpen] = useState(false)
   const [exportBusy, setExportBusy] = useState(false)
   const filteredHotspots = useMemo(() => filterHotspots(hotspots, filters), [filters, hotspots])
-  const orderedHotspots = useMemo(() => sortHotspots(filteredHotspots, sort), [filteredHotspots, sort])
+  const orderedHotspots = useMemo(() => undefined, [filteredHotspots, sort])
   const toggleRisk = (risk: (typeof HOTSPOT_RISKS)[number]) => {
     setDraftFilters((current) => ({
killedBy: completed analysis result loading keeps findings and hotspots after the polling status changes to completed
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ArrayDeclaration
src/App.tsx:601:79
   const [filterDialogOpen, setFilterDialogOpen] = useState(false)
   const [exportBusy, setExportBusy] = useState(false)
   const filteredHotspots = useMemo(() => filterHotspots(hotspots, filters), [filters, hotspots])
-  const orderedHotspots = useMemo(() => sortHotspots(filteredHotspots, sort), [filteredHotspots, sort])
+  const orderedHotspots = useMemo(() => sortHotspots(filteredHotspots, sort), [])
   const toggleRisk = (risk: (typeof HOTSPOT_RISKS)[number]) => {
     setDraftFilters((current) => ({
killedBy: completed analysis result loading filters, sorts, and exports hotspots using the visible rows
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <code>
  src/other.py
</code> instead

[Killed] LogicalOperator
src/App.tsx:865:24
       setLlmMessage('Saved. The API key is never shown again.')
     } catch (error) { setLlmMessage(error instanceof Error ? error.message : 'LLM configuration failed.') }
   }
-  const hotspotCount = summary.hotspot_count ?? 0
+  const hotspotCount = summary.hotspot_count && 0
killedBy: analysis history and quality KPI shows total hotspots in Quality Gate while preserving new-hotspot evidence
statusReason: Unable to find an element with the text: 11. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="app-shell"
    >
