[Killed] BlockStatement
src/api.ts:157:94
   return request<AnalysisRunListResponse>(`/api/v1/projects/${encodeURIComponent(projectId)}/analyses?limit=${limit}&offset=${offset}`)
 }
 
-export function getAnalysisHistory(limit = 20, offset = 0): Promise<AnalysisHistoryResponse> {
-  return request<AnalysisHistoryResponse>(`/api/v1/analyses/history?limit=${limit}&offset=${offset}`)
-}
+export function getAnalysisHistory(limit = 20, offset = 0): Promise<AnalysisHistoryResponse> {}
 
 export function deleteAnalysis(id: string): Promise<void> {
killedBy: project history API contract requests the flat history endpoint and deletes an encoded analysis
statusReason: expected [ [ …(2) ] ] to deeply equal [ [ …(2) ], [ …(2) ] ]

[Killed] BlockStatement
src/api.ts:161:59
   return request<AnalysisHistoryResponse>(`/api/v1/analyses/history?limit=${limit}&offset=${offset}`)
 }
 
-export function deleteAnalysis(id: string): Promise<void> {
-  return request<void>(`/api/v1/analyses/${encodeURIComponent(id)}`, { method: 'DELETE' })
-}
+export function deleteAnalysis(id: string): Promise<void> {}
 
 export function getQualityPolicy(projectId: string): Promise<QualityPolicy> {
killedBy: project history API contract requests the flat history endpoint and deletes an encoded analysis
statusReason: expected [ [ …(2) ] ] to deeply equal [ [ …(2) ], [ …(2) ] ]

[Killed] ObjectLiteral
src/api.ts:162:70
 }
 
 export function deleteAnalysis(id: string): Promise<void> {
-  return request<void>(`/api/v1/analyses/${encodeURIComponent(id)}`, { method: 'DELETE' })
+  return request<void>(`/api/v1/analyses/${encodeURIComponent(id)}`, {})
 }
 
killedBy: project history API contract requests the flat history endpoint and deletes an encoded analysis
statusReason: expected [ [ …(2) ], [ …(2) ] ] to deeply equal [ [ …(2) ], [ …(2) ] ]

[Killed] StringLiteral
src/api.ts:162:80
 }
 
 export function deleteAnalysis(id: string): Promise<void> {
-  return request<void>(`/api/v1/analyses/${encodeURIComponent(id)}`, { method: 'DELETE' })
+  return request<void>(`/api/v1/analyses/${encodeURIComponent(id)}`, { method: "" })
 }
 
killedBy: project history API contract requests the flat history endpoint and deletes an encoded analysis
statusReason: expected [ [ …(2) ], [ …(2) ] ] to deeply equal [ [ …(2) ], [ …(2) ] ]
